Tekla Open API Reference for Tekla Structures 2025
AnalysisObject.Select Method
 Selects an analysis object from the database.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract void Select()
Public MustOverride Sub Select
See Also
Reference
AnalysisObject Class
Tekla.Structures.Analysis Namespace